In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name" : [ 'pranjal', 'harsh', 'priyanshu' ],
    "marks": [ 94, 82, 56 ],
    "city" : [ 'kanpur', 'agra', 'agra' ]
}

In [3]:
df= pd.DataFrame(dict1)

In [4]:
df

        name  marks    city
0    pranjal     94  kanpur
1      harsh     82    agra
2  priyanshu     56    agra

In [5]:
df.to_csv('demo.csv')

In [6]:
df.to_csv('demoindexfalse.csv',index=False)

In [7]:
df.head(2)

      name  marks    city
0  pranjal     94  kanpur
1    harsh     82    agra

In [8]:
df.tail(2)

        name  marks  city
1      harsh     82  agra
2  priyanshu     56  agra

In [10]:
df.describe()

           marks
count   3.000000
mean   77.333333
std    19.425070
min    56.000000
25%    69.000000
50%    82.000000
75%    88.000000
max    94.000000

In [13]:
demo=pd.read_csv('demo.csv')

In [14]:
demo

   Unnamed: 0       name  marks    city
0           0    pranjal     94  kanpur
1           1      harsh     82    agra
2           2  priyanshu     56    agra

In [15]:
demo['marks']

0    94
1    82
2    56
Name: marks, dtype: int64

In [17]:
demo['marks'][0]

np.int64(94)

In [18]:
demo['marks'][0]=96

C:\Users\dixit\AppData\Local\Temp\ipykernel_22168\662622838.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demo['marks'][0]=96

In [19]:
demo

   Unnamed: 0       name  marks    city
0           0    pranjal     96  kanpur
1           1      harsh     82    agra
2           2  priyanshu     56    agra

In [20]:
demo.to_csv('demo.csv')

In [21]:
demo.index  = ['first', 'second', 'third']

In [22]:
demo

        Unnamed: 0       name  marks    city
first            0    pranjal     96  kanpur
second           1      harsh     82    agra
third            2  priyanshu     56    agra

In [ ]:
#newpart-------------------------------------------------------------------------------------------------------

In [25]:
ser=pd.Series(np.random.rand(34))

In [26]:
ser

0     0.356936
1     0.391365
2     0.492612
3     0.123016
4     0.306869
5     0.943046
6     0.317219
7     0.324602
8     0.432272
9     0.991667
10    0.200404
11    0.716698
12    0.325640
13    0.779866
14    0.160206
15    0.542513
16    0.291120
17    0.996413
18    0.723210
19    0.136854
20    0.153165
21    0.670841
22    0.019082
23    0.318812
24    0.781880
25    0.168872
26    0.266036
27    0.109123
28    0.014715
29    0.283720
30    0.754228
31    0.363907
32    0.522056
33    0.470122
dtype: float64

In [27]:
type(ser)

pandas.core.series.Series

In [29]:
newdf=pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [30]:
newdf.head()

          0         1         2         3         4
0  0.598777  0.820783  0.172874  0.129022  0.615119
1  0.769228  0.625038  0.147044  0.175081  0.496804
2  0.550223  0.405631  0.411613  0.619424  0.833696
3  0.960442  0.950304  0.682745  0.940451  0.815450
4  0.024518  0.223723  0.927263  0.050624  0.683589

In [31]:
type(newdf)

pandas.core.frame.DataFrame

In [32]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.521602    0.495255    0.491824    0.474819    0.498565
std      0.293918    0.289039    0.288062    0.291897    0.296610
min      0.000486    0.002219    0.002755    0.002088    0.001694
25%      0.271982    0.256457    0.251914    0.204221    0.242499
50%      0.536973    0.500373    0.463681    0.468782    0.492438
75%      0.791323    0.726004    0.736930    0.711809    0.749925
max      0.999894    0.998378    0.997886    0.992236    0.995156

In [34]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [35]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [36]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [37]:
newdf.to_numpy()

array([[0.59877725, 0.82078331, 0.17287365, 0.12902218, 0.61511873],
       [0.76922783, 0.62503794, 0.14704357, 0.17508103, 0.49680442],
       [0.55022311, 0.40563084, 0.41161348, 0.61942437, 0.8336963 ],
       ...,
       [0.36204894, 0.19725645, 0.34070412, 0.54657431, 0.47511574],
       [0.65167728, 0.58284038, 0.56527844, 0.91094868, 0.38640743],
       [0.56760933, 0.77961694, 0.70881349, 0.38913556, 0.55209085]])

In [39]:
#to transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.598777,0.769228,0.550223,0.960442,0.024518,0.876122,0.163706,0.919675,0.452895,0.567457,...,0.409570,0.419139,0.917071,0.791575,0.476305,0.842552,0.085547,0.362049,0.651677,0.567609
1,0.820783,0.625038,0.405631,0.950304,0.223723,0.574006,0.587512,0.027819,0.432398,0.370856,...,0.101450,0.744766,0.389801,0.344943,0.097190,0.223466,0.662977,0.197256,0.582840,0.779617
2,0.172874,0.147044,0.411613,0.682745,0.927263,0.303238,0.564808,0.687097,0.060163,0.337634,...,0.193643,0.643585,0.645945,0.961987,0.600614,0.351286,0.452271,0.340704,0.565278,0.708813
3,0.129022,0.175081,0.619424,0.940451,0.050624,0.637510,0.629456,0.183841,0.333395,0.192585,...,0.082832,0.141088,0.026541,0.255277,0.931920,0.904316,0.153643,0.546574,0.910949,0.389136
4,0.615119,0.496804,0.833696,0.815450,0.683589,0.599606,0.213173,0.458595,0.358235,0.270360,...,0.360635,0.398642,0.910809,0.385585,0.840035,0.822666,0.472605,0.475116,0.386407,0.552091

In [42]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.567609  0.779617  0.708813  0.389136  0.552091
332  0.651677  0.582840  0.565278  0.910949  0.386407
331  0.362049  0.197256  0.340704  0.546574  0.475116
330  0.085547  0.662977  0.452271  0.153643  0.472605
329  0.842552  0.223466  0.351286  0.904316  0.822666
..        ...       ...       ...       ...       ...
4    0.024518  0.223723  0.927263  0.050624  0.683589
3    0.960442  0.950304  0.682745  0.940451  0.815450
2    0.550223  0.405631  0.411613  0.619424  0.833696
1    0.769228  0.625038  0.147044  0.175081  0.496804
0    0.598777  0.820783  0.172874  0.129022  0.615119

[334 rows x 5 columns]

In [44]:
newdf.columns=list('ABCDE')

In [46]:
newdf.head()

          A         B         C         D         E
0  0.598777  0.820783  0.172874  0.129022  0.615119
1  0.769228  0.625038  0.147044  0.175081  0.496804
2  0.550223  0.405631  0.411613  0.619424  0.833696
3  0.960442  0.950304  0.682745  0.940451  0.815450
4  0.024518  0.223723  0.927263  0.050624  0.683589

In [50]:
newdf.loc[(newdf['A']<0.3)&(newdf['C']>0.1)]

            A         B         C         D         E
4    0.024518  0.223723  0.927263  0.050624  0.683589
6    0.163706  0.587512  0.564808  0.629456  0.213173
10   0.017662  0.421792  0.336488  0.228783  0.407288
12   0.010455  0.183449  0.337585  0.889414  0.905226
18   0.298109  0.103834  0.157230  0.316862  0.496494
..        ...       ...       ...       ...       ...
314  0.216588  0.967261  0.701809  0.839545  0.045720
318  0.228704  0.303531  0.996782  0.977225  0.350528
321  0.228098  0.940617  0.550058  0.088415  0.971623
322  0.245377  0.593338  0.731534  0.061913  0.055965
330  0.085547  0.662977  0.452271  0.153643  0.472605

[86 rows x 5 columns]

In [51]:
#gintikarne ke liye
newdf.iloc[0,4]

np.float64(0.615118733839128)

In [52]:
df.drop_duplicates(subset=['name'])

        name  marks    city
0    pranjal     94  kanpur
1      harsh     82    agra
2  priyanshu     56    agra